[
    {
        "saga":"Sayajin",
        "descripcion":"4 años después del Torneo Mundial 23º, una amenaza llamada saiyano se avecina a la Tierra. Goku descubre sus verdaderos orígenes; y ahora los Guerreros Z deben pelear por el futuro del planeta.",
        "episodios":"1-35",
        "antagonistas":[
            "Raditz",
            "Vegeta",
            "Nappa"
        ]
    },
    {
        "saga":"Namek y Freezer",
        "descripcion":"Luego de la desaparición de las Esferas del Dragón, Bulma, Krilin y Gohan parten al planeta natal de Kami y Piccolo para revivir a sus amigos fallecidos en la batalla contra los saiyanos, usando las Esferas del Dragón originales.",
        "episodios":"36-107",
        "antagonistas":[
            "Freezer",
            "Dodoria",
            "Zarbon",
            "Fuerzas especiales Ginyu"
        ]
    },
    {
        "saga":"Garlic Jr",
        "descripcion":"Meses después de la batalla en Namek, Garlic Jr. logra escapar de su encierro con el fin de acabar con Kami y Piccolo, y a su vez convertirse en el nuevo dios de la Tierra.",
        "episodios":"108-117",
        "antagonistas":[
            "Garlic Jr",
            "La Familia del Mal"
        ]
    },
    {
        "saga":"Androides y Cell",
        "descripcion":"Un joven del futuro advierte a Goku sobre una gran amenaza que asechará la Tierra dentro de 3 años, por lo que él y los Guerreros Z se ponen un duro entrenamiento para estar preparados para lo que sería, la batalla por el futuro del mundo.",
        "episodios":"118-194 ",
        "antagonistas":[
            "Cell",
            "Androide No. 16",
            "Androide No. 17",
            "Androide No. 18",
            "Androide No. 19",
            "Androide No. 20"
        ]
    },
    {
        "saga":"Majin-Buu",
        "descripcion":"Han pasado ya 7 años de la derrota de Cell y la paz reina en la Tierra. Hasta que el mago Bobbidi llega al planeta con el fin de despertar Monstruo Boo. Ahora, los Guerreros Z deben evitar que el malvado cumpla sus planes y salvar al universo.",
        "episodios":"205-291",
        "antagonistas":[
            "Majin-Buu",
            "Buu",
            "Babidi",
            "Dabura"
        ]
    }
]